cats_99/app/controllers/cats_controller.rb

  def show
    @cats = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "name" = $2, "description" = $3, "updated_at" = $4 WHERE "cats"."id" = $5  [["color", "Green"], ["name", "JOHNNY BOI"], ["description", "CATCATAACAT"], ["updated_at", "2018-09-11 22:21:24.365990"], ["id", 3]]